gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            case S4_RECORD_DATA:
                watchdog_message_maple("Recording data\r\n", BPACKET_CODE_DEBUG);
                // Record the current temperature
                //                 if (ds18b20_read_temperature(DS18B20_SENSOR_ID_2) != TRUE) {
                // #ifdef DEBUG
                //                     watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to read temperature");
                // #endif
                //                 }

                //                 ds18b20_temp_t temp;
                //                 if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_2, &temp) != TRUE) {
                // #ifdef DEBUG
                //                     watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to copy temperature");
                // #endif
                //                 }

                //                 // Turn Watchdog on
                //                 watchdog_esp32_on();

                //                 // Update the datetime struct
                //                 stm32_rtc_read_datetime(&datetime);

                //                 // Get the real time clock time and date. Put it in a packet and send to the ESP32
                //                 bpacket_t photoRequest;
                //                 uint8_t result1 = wd_datetime_to_bpacket(&photoRequest, BPACKET_ADDRESS_ESP32,
                //                 BPACKET_ADDRESS_STM32,
                //                                                          WATCHDOG_BPK_R_TAKE_PHOTO,
                //                                                          BPACKET_CODE_EXECUTE, &datetime);

                //                 // Confirm datetime was able to be converted
                //                 if (result1 != TRUE) {
                // #ifdef DEBUG
                //                     watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to convert datetime to
                //                     bpacket");
                // #endif
                //                     break;
                //                 }

                //                 // Send request to take a photo
                //                 watchdog_send_bpacket_to_esp32(&photoRequest);

                //                 // Confirm photo was able to be taken
                //                 uint32_t timeout;
                //                 uint8_t overflow = FALSE;
                //                 if ((UINT_32_BIT_MAX_VALUE - SysTick->VAL) <= 5000) {
                //                     timeout  = 5000 - (UINT_32_BIT_MAX_VALUE - SysTick->VAL);
                //                     overflow = TRUE;
                //                 } else {
                //                     timeout = SysTick->VAL + 5000;
                //                 }

                //                 while ((SysTick->VAL <= timeout) || (overflow == TRUE && timeout < SysTick->VAL)) {

                //                     if (overflow == TRUE && timeout <= SysTick->VAL) {
                //                         overflow = FALSE;
                //                     }

                //                     // Check if a request has been received
                //                     while (comms_process_rxbuffer(ESP32_UART, &esp32Bpacket) != TRUE) {
                //                         continue;
                //                     }

                //                     // Process bpacket
                //                     if (esp32Bpacket.request != WATCHDOG_BPK_R_TAKE_PHOTO) {
                // #ifdef DEBUG
                //                         watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Unexpected packet
                //                         received");
                // #endif
                //                         break;
                //                     }

                //                     if (esp32Bpacket.code != BPACKET_CODE_SUCCESS) {
                // #ifdef DEBUG
                //                         watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to take a photo");
                // #endif
                //                         break;
                //                     }

                //     state = S5_SET_RTC_ALARM;
                //     break;
                // }

                // Turn the watchdog off
                // watchdog_esp32_off();

                //                 if (state != S5_SET_RTC_ALARM) {
                // #ifdef DEBUG
                //                     watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to get response");
                // #endif
                //                     state = S3_STM32_SLEEP;
                //                 }

                break;

            case S5_SET_RTC_ALARM:;
                watchdog_message_maple("Upating RTC Alarm\r\n", BPACKET_CODE_DEBUG);

                // Get the current RTC time
                dt_datetime_t alarmDateTime;
                stm32_rtc_read_datetime(&alarmDateTime);

                dt_time_t currentTime;
                uint8_t nextAlarmFound = TRUE;

                if (dt_time_init(&currentTime, 0, alarmDateTime.time.minute, alarmDateTime.time.hour) != TRUE) {
                    nextAlarmFound = FALSE;
                }

                // Increment the day if the interval overflowed or the interval made the time past the end time
                if ((dt_time_add_time(&currentTime, wdSettings.captureTime.intervalTime) != TRUE) &&
                    (dt_time_t1_leq_t2(&currentTime, &wdSettings.captureTime.endTime) != TRUE)) {

                    // Adding the interval caused the time to overflow (i.e hour > 23)
                    dt_datetime_increment_day(&alarmDateTime);
                    if (dt_datetime_set_time(&alarmDateTime, wdSettings.captureTime.startTime) != TRUE) {
                        nextAlarmFound = FALSE;
                    }
                }

                // Update the alarm if a valid one was calculated
                if (nextAlarmFound == TRUE) {
                    watchdog_message_maple("Alarm updated\r\n", BPACKET_CODE_DEBUG);
                    stm32_rtc_set_alarmA(&alarmDateTime);
                }

