gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
void watchdog_create_and_send_bpacket_to_esp32(uint8_t request, uint8_t code, uint8_t numBytes, uint8_t* data) {
    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;
    bpacket_create_p(&bpacket, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32, request, code, numBytes, data);
    bpacket_to_buffer(&bpacket, &packetBuffer);
    comms_transmit(ESP32_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_message_maple(char* string, uint8_t bpacketCode) {

    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;

    switch (bpacketCode) {

        case BPACKET_CODE_TODO:
        case BPACKET_CODE_SUCCESS:
        case BPACKET_CODE_DEBUG:
        case BPACKET_CODE_ERROR:
            bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, BPACKET_GEN_R_MESSAGE,
                              bpacketCode, string);
            break;

        default:
            bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, BPACKET_GEN_R_MESSAGE,
                              BPACKET_CODE_ERROR, "Failed to create watchdog message!\r\n");
    }

    bpacket_to_buffer(&bpacket, &packetBuffer);
    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_send_bpacket_to_esp32(bpacket_t* bpacket) {
    bpacket_buffer_t bpacketBuffer;
    bpacket_to_buffer(bpacket, &bpacketBuffer);
    comms_transmit(ESP32_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
}

void watchdog_send_bpacket_to_maple(bpacket_t* bpacket) {
    bpacket_buffer_t bpacketBuffer;
    bpacket_to_buffer(bpacket, &bpacketBuffer);
    comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
}

void process_watchdog_stm32_request(bpacket_t* bpacket) {

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_LED_RED_ON:

            if (bpacket->code == BPACKET_CODE_EXECUTE) {
                watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_LED_RED_ON, BPACKET_CODE_EXECUTE, 0, NULL);
                break;
            }

            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                watchdog_report_success(WATCHDOG_BPK_R_LED_RED_ON);
                break;
            }

            watchdog_message_maple("Invalid code for LED on!\r\n", BPACKET_CODE_ERROR);

            break;

        case WATCHDOG_BPK_R_LED_RED_OFF:

            if (bpacket->code == BPACKET_CODE_EXECUTE) {
                watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_LED_RED_OFF, BPACKET_CODE_EXECUTE, 0, NULL);
                break;
            }

            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                watchdog_report_success(WATCHDOG_BPK_R_LED_RED_OFF);
                break;
            }

            watchdog_message_maple("Invalid code for LED off!\r\n", BPACKET_CODE_ERROR);

            break;

        case BPACKET_GEN_R_PING:

            if (bpacket->code == BPACKET_CODE_EXECUTE) {
                uint8_t ping = WATCHDOG_PING_CODE_STM32;
                watchdog_create_and_send_bpacket_to_maple(BPACKET_GEN_R_PING, BPACKET_CODE_SUCCESS, 1, &ping);
                break;
            }

            watchdog_message_maple("Invalid code for Ping!\r\n", BPACKET_CODE_ERROR);

            break;

        case BPACKET_GEN_R_MESSAGE:
            log_send_bdata(bpacket->bytes, bpacket->numBytes);
            break;

        default:;
            char errorMsg[30];
            sprintf(errorMsg, "Unknown request %i\r\n", bpacket->request);
            watchdog_message_maple(errorMsg, BPACKET_CODE_ERROR);
    }
}

void watchdog_print_wd_error(uint8_t result) {
    char msg[40];
    wd_get_error(result, msg);
    log_error(msg);
}

uint8_t stm32_match_esp32_request(bpacket_t* bpacket) {

    char tempMsg[100];
    sprintf(tempMsg, "Rec: %i Send: %i Req: %i Code: %i numBytes: %i\r\n", bpacket->receiver, bpacket->sender,
            bpacket->request, bpacket->code, bpacket->numBytes);
    watchdog_message_maple(tempMsg, BPACKET_CODE_DEBUG);

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // ESP32 Response to request from STM32 to take a photo

            if (bpacket->code == BPACKET_CODE_SUCCESS) { // Photo was succesfully taken

#ifdef DEBUG
                watchdog_report_success(WATCHDOG_BPK_R_TAKE_PHOTO);
#endif

                // TODO: Need to update RTC Alarm
                watchdog_message_maple("Need to update RTC alarm\r\n\0", BPACKET_CODE_TODO);
                break;
            }

            // If photo could not be taken, print error code to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_create_and_send_bpacket_to_maple(WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_ERROR,
                                                          bpacket->numBytes, bpacket->bytes);
                break;
            }

            break;

        case WATCHDOG_BPK_R_GET_SETTINGS:

            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {

                // Store watchdog settings in struct
                uint8_t result = wd_bpacket_to_settings(bpacket, &wdSettings);

                if (result != TRUE) {
                    watchdog_print_wd_error(result);
                    break;
                }

                // // watchdog_report_success(WATCHDOG_BPK_R_GET_SETTINGS);

                char k[52];
                sprintf(k, "Cam res: %i Start time: %i %i End time: %i %i", wdSettings.cameraSettings.resolution,
                        wdSettings.captureTime.startTime.minute, wdSettings.captureTime.startTime.hour,
                        wdSettings.captureTime.endTime.minute, wdSettings.captureTime.endTime.hour);
                log_send_data(k, chars_get_num_bytes(k));
                break;
            }

            // If reading the watchdog settings fails, write the default watchdog
            // settings to the ESP32
            if (bpacket->code == BPACKET_CODE_ERROR) {

                watchdog_message_maple("Failed to read Watchdog settings\r\n", BPACKET_CODE_ERROR);

                bpacket_t settings;
                uint8_t result = wd_settings_to_bpacket(&settings, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32,
                                                        WATCHDOG_BPK_R_SET_SETTINGS, BPACKET_CODE_EXECUTE, &wdSettings);

                // Write camera settings to the esp32
                if (result == TRUE) {
                    watchdog_send_bpacket_to_esp32(&settings);
                    watchdog_message_maple("Wrote default settings", BPACKET_CODE_DEBUG);
                } else {
                    watchdog_message_maple("Failed to write default settings", BPACKET_CODE_ERROR);
                }

                break;
            }

            watchdog_message_maple("ESP32 returned unknown code when request to get wd settings", BPACKET_CODE_ERROR);

            break;

        case WATCHDOG_BPK_R_SET_SETTINGS:

