gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                // watchdog_report_success(WATCHDOG_BPK_R_SET_SETTINGS);
                watchdog_message_maple("Set new settings", BPACKET_CODE_SUCCESS);
                break;
            }

            // Log failure to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_message_maple("Failed to write settings to ESP32", BPACKET_CODE_ERROR);
            }

            watchdog_message_maple("ESP32 returned invalid code when udpating wd settings", BPACKET_CODE_ERROR);

            break;

        default:
            return FALSE;
    }

    return TRUE;
}

uint8_t stm32_match_maple_request(bpacket_t* bpacket) {

    bpacket_buffer_t bpacketBuffer;
    uint8_t request = bpacket->request;
    uint8_t result;

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // Send command to ESP32 to take a photo

            // Record the current temperature from both temperature sensors
            if (ds18b20_read_temperature(DS18B20_SENSOR_ID_1) != TRUE) {
                watchdog_message_maple("Failed to read temperature", BPACKET_CODE_ERROR);
            }

            ds18b20_temp_t temp1;
            if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_1, &temp1) != TRUE) {
                watchdog_message_maple("Failed to copy temperature", BPACKET_CODE_ERROR);
            }

            if (ds18b20_read_temperature(DS18B20_SENSOR_ID_2) != TRUE) {
                watchdog_message_maple("Failed to read temperature", BPACKET_CODE_ERROR);
            }

            ds18b20_temp_t temp2;
            if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_2, &temp2) != TRUE) {
                watchdog_message_maple("Failed to copy temperature", BPACKET_CODE_ERROR);
            }

            // Update the datetime struct
            stm32_rtc_read_datetime(&datetime);

            // Get the real time clock time and date. Put it in a packet and send to the ESP32
            bpacket_t photoRequest;

            result =
                wd_photo_data_to_bpacket(&photoRequest, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32,
                                         WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_EXECUTE, &datetime, &temp1, &temp2);

            if (result == TRUE) {
                watchdog_send_bpacket_to_esp32(&photoRequest);
            } else {
                char errMsg[50];
                wd_get_error(result, errMsg);
                char msg[130];
                sprintf(msg, "Failed to convert photo data to bpacket with error: %s\r\n", errMsg);
                watchdog_message_maple(msg, BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_GET_DATETIME:

            // Get the datetime from the RTC
            stm32_rtc_read_datetime(&datetime);
            if (wd_datetime_to_bpacket(bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request,
                                       BPACKET_CODE_SUCCESS, &datetime) == TRUE) {
                bpacket_to_buffer(bpacket, &bpacketBuffer);
                comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
            } else {
                watchdog_message_maple("Failed to convert datetime to bpacket\0", BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_SET_DATETIME:

            // Set the datetime using the information from the bpacket
            if (wd_bpacket_to_datetime(bpacket, &datetime) == TRUE) {
                stm32_rtc_write_datetime(&datetime);
                watchdog_report_success(WATCHDOG_BPK_R_SET_DATETIME);
            } else {
                watchdog_message_maple("Failed to convert bpacket to datetime\0", BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_GET_CAMERA_RESOLUTION:
            watchdog_message_maple("This feature has not been implemented yet", BPACKET_CODE_TODO);
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_SET_CAMERA_RESOLUTION:
            watchdog_message_maple("This feature has not been implemented yet\r\n", BPACKET_CODE_TODO);
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_GET_STATUS:
            watchdog_message_maple("This feature has not been implemented yet\r\n", BPACKET_CODE_TODO);
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_GET_SETTINGS:;

            // Send the watchdog settings back to maple
            bpacket_t settingsPacket;
            result = wd_settings_to_bpacket(&settingsPacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32,
                                            WATCHDOG_BPK_R_GET_SETTINGS, BPACKET_CODE_SUCCESS, &wdSettings);

            if (result != TRUE) {
                watchdog_message_maple("Failed to convert settings to bpacket\r\n", BPACKET_CODE_ERROR);
                break;
            } else {
                watchdog_message_maple("Converted settings to bpacket. Sending to maple\r\n", BPACKET_CODE_DEBUG);
            }

            // Send the bpacket to maple
            bpacket_to_buffer(&settingsPacket, &bpacketBuffer);
            comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);

            break;

        case WATCHDOG_BPK_R_SET_SETTINGS:

            // Convert the bpacket to wd settings
            result = wd_bpacket_to_settings(bpacket, &wdSettings);

            if (result != TRUE) {
                char info[50];
                wd_get_error(result, info);
                watchdog_message_maple(info, BPACKET_CODE_ERROR);
                break;
            }

            // Send bpacket to ESP32
            watchdog_send_bpacket_to_esp32(bpacket);
            watchdog_message_maple("Ensure wd settings not changed until confirmation from ESP32 is received\r\n",
                                   BPACKET_CODE_TODO);

            break;

        default:
            return FALSE;
    }

    return TRUE;
}

void watchdog_update(void) {

    // // Process anything the ESP32 sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_1_ID, &esp32Bpacket) == TRUE) {
    //     if (stm32_match_esp32_request(&esp32Bpacket) != TRUE) {
    //         process_watchdog_stm32_request(&esp32Bpacket);
    //     }
    // }

    // // Process anything Maple sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_2_ID, &mapleBpacket) == TRUE) {
    //     if (stm32_match_maple_request(&mapleBpacket) != TRUE) {
    //         process_watchdog_stm32_request(&mapleBpacket);
    //     }
    // }
}

void watchdog_esp32_on(void) {
    ESP32_POWER_PORT->BSRR |= (0x01 << ESP32_POWER_PIN);

    // Delay for 1 second to let ESP32 startup
    HAL_Delay(1000);
}

void watchdog_esp32_off(void) {
    ESP32_POWER_PORT->BSRR |= (0x10000 << ESP32_POWER_PIN);
}